BreweryBE/app/controllers/beer_controller.rb

    def show
        @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def new
        @beer = Beer.new
        @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

    def create
        @beer = Beer.create(name: params[:beer][:name], typeBeer: params[:beer][:typeBeer], alc: params[:beer][:alc], brewery_id: params[:beer][:brewery_id])
---
INSERT INTO "beers" ("name", "brewery_id", "typeBeer", "alc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Mai Tai PA"], ["brewery_id", 1], ["typeBeer", "IPA "], ["alc", 7.2], ["created_at", "2021-06-26 20:30:43.204424"], ["updated_at", "2021-06-26 20:30:43.204424"]]

    def edit
        @beer = Beer.find(params[:id])
        @breweries = Brewery.all
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "breweries".* FROM "breweries"

    def update
        @beer = Beer.find(params[:id])
        @beer.update(name: params[:beer][:name], typeBeer: params[:beer][:typeBeer], alc: params[:beer][:alc], brewery_id: params[:beer][:brewery_id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "beers" SET "alc" = ?, "updated_at" = ? WHERE "beers"."id" = ?  [["alc", 7.2], ["updated_at", "2021-06-26 20:53:07.210575"], ["id", 1]]